# YOLOv11m + CBAM + P2 Extra Detection Head
# CBAM replaces C2PSA in backbone + P2/4 extra detection scale
# Based on: Ultralytics yolo11-p2.yaml (PR #16558) + CBAM (Woo et al., 2018)
nc: 1
scales:
  m: [0.50, 1.00, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 1, CBAM, [16, 7]]  # 10 CBAM replaces C2PSA

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 11
  - [[-1, 6], 1, Concat, [1]]                            # 12 cat P4
  - [-1, 2, C3k2, [512, False]]                          # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 14
  - [[-1, 4], 1, Concat, [1]]                            # 15 cat P3
  - [-1, 2, C3k2, [256, False]]                          # 16 (P3/8)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 17 NEW
  - [[-1, 2], 1, Concat, [1]]                            # 18 cat P2
  - [-1, 2, C3k2, [128, False]]                          # 19 (P2/4-xsmall)

  - [-1, 1, Conv, [128, 3, 2]]                           # 20
  - [[-1, 16], 1, Concat, [1]]                           # 21
  - [-1, 2, C3k2, [256, False]]                          # 22 (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]                           # 23
  - [[-1, 13], 1, Concat, [1]]                           # 24
  - [-1, 2, C3k2, [512, False]]                          # 25 (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]                           # 26
  - [[-1, 10], 1, Concat, [1]]                           # 27 cat P5
  - [-1, 2, C3k2, [1024, True]]                          # 28 (P5/32)

  - [[19, 22, 25, 28], 1, Detect, [1]]              # 29 Detect(P2,P3,P4,P5)
