# YOLO11m + CBAM + P2 head + FCCG (context-gated evidence) — lap-3 S0
# Base: Last Month/.../yolov11m_cbam_p2head.yaml (thesis lineage, layer-compat)
# New: FFLUp replaces nn.Upsample (FreqFusion-lite ALPF); FCCGFuse at the
#      P3 and P2 Concat seams (split_c = channels of the upsampled ctx half).
nc: 1
scales:
  m: [0.50, 1.00, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 1, CBAM, [16, 7]]             # 10 (thesis lineage: CBAM replaces C2PSA)

head:
  - [-1, 1, FFLUp, []]                 # 11 adaptive low-pass x2 (was nn.Upsample)
  - [[-1, 6], 1, Concat, [1]]          # 12 cat P4
  - [-1, 2, C3k2, [512, False]]        # 13
  - [-1, 1, FFLUp, []]                 # 14
  - [[-1, 4], 1, Concat, [1]]          # 15 cat P3   (512 ctx + 512 lateral)
  - [-1, 1, FCCGFuse, [512]]           # 16 ** context-gated evidence @P3 seam
  - [-1, 2, C3k2, [256, False]]        # 17 (P3/8)
  - [-1, 1, FFLUp, []]                 # 18
  - [[-1, 2], 1, Concat, [1]]          # 19 cat P2   (256 ctx + 256 lateral)
  - [-1, 1, FCCGFuse, [256]]           # 20 ** context-gated evidence @P2 seam
  - [-1, 2, C3k2, [128, False]]        # 21 (P2/4-xsmall)
  - [-1, 1, Conv, [128, 3, 2]]         # 22
  - [[-1, 17], 1, Concat, [1]]         # 23
  - [-1, 2, C3k2, [256, False]]        # 24 (P3/8)
  - [-1, 1, Conv, [256, 3, 2]]         # 25
  - [[-1, 13], 1, Concat, [1]]         # 26
  - [-1, 2, C3k2, [512, False]]        # 27 (P4/16)
  - [-1, 1, Conv, [512, 3, 2]]         # 28
  - [[-1, 10], 1, Concat, [1]]         # 29 cat P5
  - [-1, 2, C3k2, [1024, True]]        # 30 (P5/32)
  - [[21, 24, 27, 30], 1, Detect, [1]] # 31 Detect(P2,P3,P4,P5)
