# YOLOv11m + P2 Extra Detection Head for Small Objects
# Based on: ultralytics/ultralytics PR #16558 (yolo11-p2.yaml)
# Modification: 4-scale detection (P2/P3/P4/P5) instead of 3-scale (P3/P4/P5)

nc: 1
scales:
  m: [0.50, 1.00, 512]

# Backbone (identical to standard yolo11m)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 2, C3k2, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]     # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9
  - [-1, 2, C2PSA, [1024]]          # 10

# Head with P2 extra detection scale
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 11
  - [[-1, 6], 1, Concat, [1]]                            # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                          # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 14
  - [[-1, 4], 1, Concat, [1]]                            # 15 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                          # 16 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]          # 17 NEW: upsample to P2
  - [[-1, 2], 1, Concat, [1]]                            # 18 NEW: cat backbone P2
  - [-1, 2, C3k2, [128, False]]                          # 19 NEW: P2/4-xsmall

  - [-1, 1, Conv, [128, 3, 2]]                           # 20
  - [[-1, 16], 1, Concat, [1]]                           # 21 cat head P3
  - [-1, 2, C3k2, [256, False]]                          # 22 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                           # 23
  - [[-1, 13], 1, Concat, [1]]                           # 24 cat head P4
  - [-1, 2, C3k2, [512, False]]                          # 25 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                           # 26
  - [[-1, 10], 1, Concat, [1]]                           # 27 cat head P5
  - [-1, 2, C3k2, [1024, True]]                          # 28 (P5/32-large)

  - [[19, 22, 25, 28], 1, Detect, [nc]]                  # 29 Detect(P2, P3, P4, P5)
